{
  "navbar": {
    "home": "Home",
    "about": "About Me",
    "game": "Game",
    "showcase": "Showcase",
    "model": "3D Models",
    "resume": "Resume"
  },

  "footer": {
    "copyright": "© 2025 Charles Pan. All Rights Reserved."
  },

  "home": {
    "hero1" : "Welcome to",
    "hero2_first" : "Charles",
    "hero2_second" : " Realm",
    "hero-sub" : "Everything you need to know about me"
  },

  "about": {
    "intro":{
      "title": "About Me",
      "content": "I am a Computer Science Master student, focusing on Game Development. I love coding and trying new technologies. I love games and designing games."
    },
    "techstack":{
      "title": "My Tech Stack",
      "content": "Software and API:\n  Game: Unity3D, Unreal\n  Frontend: React, Bootstrap, MUI, MERN Stack\n\nProgramming Languages:\n  C#, C++, Python, javascript, HTML, CSS, etc."
    },
    "hobby":{
      "title": "My Hobby",
      "content":"In addition, I also love modeling. I can use modeling software such as Zbrush, Maya, as well as Substance Painter, Substance Designeer, Photoshop and other software to create textures."
    }
  },

  "game":{
    "play": "Play",

    "gamedata": {
      "morph": {
        "title": "Morph",
        "tags": ["Unity", "PC", "2D", "Platformer", "Indie", "Puzzle", "Pixel", "Physics"]
      },
      "planet": {
        "title": "Procedural Planet",
        "tags": ["Unity", "PC", "3D", "Procedural", "Simulation", "Shader", "Noise", "Terrain"]
      },
      "knight": {
        "title": "Knight and Spear",
        "tags": ["Unity", "PC", "2D", "Pixel", "RogueLike", "Arena", "Epic"]
      },
      "tetris": {
        "title": "Tetris Rush",
        "tags": ["Unity", "PC", "3D", "GameJam", "Puzzle", "Arcade", "LowPoly"]
      },
      "seagull": {
        "title": "Seagull Express",
        "tags": ["Unity", "Mobile", "2D", "Delivery", "Runner", "Cartoon", "Animals"]
      }
    }
  },

  "showcase":{
    "checkout": "Check Out My Projects",
    "showcaseData":{
      "PBR": {
        "title": "PBR Rendering - OpenGL",
        "description": "A PBR renderer implemented using OpenGL and C++, based on the LearnOpenGL tutorial. It features a complete PBR pipeline, including model and material data processing, GLSL shader programming for the GPU, lighting calculations based on the Cook-Torrance BRDF model, and Image-Based Lighting (IBL) for realistic environmental reflections. The project uses the Suzanne model with custom textures created in Adobe Substance Painter and irradiance maps generated from a Shanghai nightscape cubemap using a tool like Lys/CMFT."
      },
      "Shader": {
        "title": "Shader Playground",
        "description": "A collection of shader experiments in Unity, primarily inspired by Zhuang Dong's shader development tutorials on Bilibili. This project explores various shader effects written in ShaderLab, ranging from basic Lambertian lighting to advanced techniques like MatCap, cubemaps, and custom blend modes for special effects."
      },
      "Resume": {
        "title": "Resume Saver - MERN Stack",
        "description": "A full-stack resume generator web application built with the MERN stack (MongoDB, Express, React, Node.js) and Material UI. It features user authentication via Passport.js, a dashboard for managing multiple resume workspaces, and a powerful editor. Users can input resume details manually or import them from an uploaded PDF (with a clipboard feature for easy data extraction). The app supports real-time formatting adjustments in an inspector panel and generates downloadable PDFs using PDFKit. References include NYU Resume Guide, PDF.js, and pdf-parse."
      },
      "RayTracing": {
        "title": "Ray Tracing - OpenGL",
        "description": "A GPU-based Ray Tracing renderer implemented in C++ and OpenGL, developed as a final project for the NYU Graphics course. The project involves defining geometry and lighting classes on the CPU and transferring data to the GPU via buffers. Since GPU shaders do not support recursion, the ray tracing logic—including intersection testing and specular reflection—is implemented using iterative loops and depth management to simulate recursive light paths."
      }
    }
  },

  "model":{
    "title": "Model Showcase",
    "subTitle": "Created using Zbrush, Maya, Substance, and more",
    "element": "SHOTS",
    "modeldata":{
      "Chocobo": "Chocobo",
      "Eva": "Evangelion Unit-02",
      "Kuromi": "Kuromi On a Saturn",
      "restaurant": "Restaurant",
      "Boxing": "Goblin vs. Moai"
    }
  },

  "resume": {
    "title": "My Resume",
    "instructions": "Hover over the card to preview or download the PDF. \n\n You can download resumes in two languages: English and Chinese.",
    "english": "English Version",
    "chinese": "Chinese Version",
    "pdfPreview": "PDF PREVIEW",
    "buttons": {
      "download": "Download",
      "preview": "Preview"
    }
  }

}
  